---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.Smoothness
source: html/3e08fa98-7193-8337-c34e-41d299a154e5.htm
---
# Autodesk.Revit.DB.MaterialNode.Smoothness Property

The level of smoothness of the material.

## Syntax (C#)
```csharp
public int Smoothness { get; }
```